# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)
require 'open-uri'
require 'uri'
require 'net/http'

page3 = Nokogiri::HTML(open('http://haemukja.com/main'))
@category = page3.css('ul.big_sort li a')
@category.each do |c|
  page2 = Nokogiri::HTML(open("http://haemukja.com/get_bf_group_items.json?bf_group_id=#{c['data-id']}"))
  result = JSON.parse(page2)
  result_list = []
  temp = ""
  result.each do |re|
    result_list << re['name'].encode("iso-8859-1").force_encoding("utf-8")
  end
  puts "item에 #{c.text}카테고리의 재료:#{result_list} 집어넣는중"
  temp = result_list.join(",")
  # temp = "\'"+result_list.join("\',\'")+"\'"
  Item.create(ss_category: c.text, ss_ingred: temp)
end
puts "item 완료"


agent = Mechanize.new

puts "레시피 넣기 시작"
  Array(1..4770).each do |p_num|
    puts "#{p_num}번째 레시피 넣는중"
    page = agent.get"http://haemukja.com/recipes/#{p_num}"
    #긁어온 페이지에 레시피가 존재하는지 검사
    if page.title != "해먹남녀 - 요리가 쉬워지는 레시피"
      puts "if문 들어옴"
      page2 = Nokogiri::HTML(open("http://haemukja.com/recipes/#{p_num}"))
      img_link_temp = page2.css('ul.slides img')
      if img_link_temp.length != 0
        puts "nil 아님"
        img_link_temp = page2.css('ul.slides img')[0]['src']
      end
      Recipe.create(link: "http://haemukja.com/recipes/#{p_num}", title: page.search("div.top h1 strong").text, 
      ingred: page.search("ul.lst_ingrd span").map{|a| a.text}.uniq, 
      s_count: page.search("dd#scrap-cnt").text, img_link: img_link_temp)

    end
  end





# [
#     ["곡류", "귀리", "귀리가루", "누룽지", "머핀믹스", "메밀가루", "밀가루", "백미", "보리", "보리밥", "부침가루", "브라우니믹스", "빵가루", "식빵믹스", "쌀가루", "쌀밥", "쌀죽", "옥수수가루", "옥수수전분", "옥수수통조림", "율무", "제과용밀가루", "제빵용밀가루", "즉석밥", "찐옥수수", "찰옥수수", "참치죽", "찹쌀", "찹쌀가루", "찹쌀풀", "치킨가루", "쿠스쿠스", "퀴노아", "통밀", "튀김가루", "핫케익가루", "햇반", "현미", "현미가루", "현미밥", "흑미"],
#     ["면/만두류", "간짬뽕", "고기만두", "국수 마른것", "너구리순한맛(농심)", "너구리얼큰한맛(농심)", "떡볶이", "라면사리", "라이스페이퍼", "라자냐", "마카로니 마른것", "만두피", "메밀국수 건면", "메밀국수 생면", "메밀냉면", "물만두", "불닭볶음면", "삼양라면(삼양)", "생면", "소멘", "소면 마른것", "수제비", "스파게티면", "스프분말", "신라면(농심)", "쌀국수", "양파스프 분말", "우동면", "인스턴트짜장면", "중면 마른것", "진라면매운맛(오뚜기)", "쫄면", "칼국수면", "크림스프 분말", "파스타면", "팔도비빔면", "푸실리"] ,
#     ["빵류", "건빵", "꽃빵", "도너츠", "머핀", "모닝빵", "바게트", "바닐라푸딩", "베이글", "소보로빵", "스펀지케이크", "식빵", "우유식빵", "잉글리쉬머핀", "초콜렛프로스팅도너츠", "쵸코파이", "치아바타", "치즈케이크", "치즈피자", "카스테라", "커스터드빵", "크로아상", "크루통", "토스트식빵", "팥호빵", "팬케이크", "페이스트리", "페퍼로니피자", "피자", "핫도그빵", "핫케이크", "햄버거/핫도그용빵", "햄버거빵", "호밀빵"] ,
#     ["과자류", "나쵸", "또띠아", "마카롱", "브라우니", "비스켓", "새우깡(농심)", "애플쨈(롯데)", "초코샌드", "초코칩쿠키", "쵸코칩쿠키", "치즈샌드크래커", "치토스매콤한맛(오리온)", "칼슘 양파링(농심)", "코코볼", "콘푸레이크", "콘푸로스트", "쿠키", "크래커", "크림웨하스", "팝콘", "프레첼"] ,
#     ["떡류", "가래떡", "떡국떡", "떡볶이떡", "조랭이떡", "찹쌀떡"] ,
#     ["감자/고구마류", "감자", "감자 삶은것", "감자전분", "감자튀김", "고구마", "고구마 말린것", "고구마 찐것", "고구마전분", "곤약", "당면", "당면삶은것", "물전분", "새알감자", "실곤약", "토란", "호박고구마"],
#     ["묵/두부", "도토리묵", "두부", "순두부", "연두부", "유부", "콩비지", "콩비지"],
#     ["콩/견과류", "강낭콩", "검은깨", "검정콩 서리태", "견과", "노란콩", "녹두", "도토리", "도토리가루", "들깨가루", "땅콩 볶은것", "땅콩가루", "렌즈(렌틸)콩", "리마콩 통조림", "마카다미아", "밤", "백두", "병아리콩", "병아리콩 삶은것", "병아리콩 통조림", "붉은팥", "생땅콩", "아몬드", "아몬드 슬라이스", "아몬드가루", "완두콩", "잣 말린것", "참깨", "치아씨드", "캐슈너트", "코코넛밀크", "코코넛워터", "코코넛파우더", "콩가루", "콩물", "콩자반", "팥앙금", "피스타치오", "피칸", "해바라기씨", "헤이즐넛", "호두", "호박씨"] ,
#     ["채소류", "가지", "각종 버섯", "각종 잎채소", "각종 채소", "갓김치", "갯나물", "게걸무", "겨자잎", "고구마줄기", "고구마줄기 삶은것", "고사리나물", "고사리나물 말린것", "고사리나물 삶은것", "고수", "고추냉이", "고추씨싹", "고추장아찌", "곤드레나물", "곰취", "그린비타민", "김치국물", "깍두기", "깨나물", "깻잎", "꽃상추", "꽈리고추", "냉이", "노란파프리카", "느타리버섯", "단무지", "단호박", "단호박 삶은것", "달래", "당귀", "당근", "대파", "더덕", "도라지", "도라지 말린것", "돌나물", "동채", "동치미", "두릅", "들미나리", "레몬그라스", "로메인상추", "루꼴라", "마늘", "마늘장아찌", "마늘쫑", "만가닥버섯", "만가닥버섯", "명이나물", "목이버섯 말린것", "무말랭이", "무순", "무우거지", "무즙", "무청시래기", "물강활", "미나리", "바질", "바질 말린것", "방울토마토", "배추", "배추김치", "백김치", "버터넛 익힌것", "베이비캐롯", "봄동", "부추", "붉은양배추", "브로콜리", "브로콜리 데친것", "비트", "상추", "새송이버섯", "새송이버섯 데친것", "새싹채소", "생강", "생강넥타", "생강초절임", "섬초롱", "세발나물", "셀러리", "송이버섯", "숙주나물", "시금치", "시금치 데친것", "실파", "쑥", "쑥갓", "아기양배추", "아스파라거스", "아욱", "아티초크", "애호박", "양배추", "양상추", "양송이버섯", "양파", "양파간것", "양파즙", "얼갈이", "연근", "열무", "열무김치", "열무물김치", "오이", "오이고추", "오이피클", "우엉", "우엉조림", "적파프리카", "조선무", "주키니호박", "주황파프리카", "죽순", "죽순 통조림", "쪽파", "차이브", "참나물", "청경채", "청치커리", "청파프리카", "청피망", "총각김치", "취나물", "취나물 말린것", "컬리플라워", "케일", "콜라비", "콩나물", "콩나물 데친것", "토란대", "토란대 삶은것", "토마토", "토마토 통조림", "토마토쥬스", "토마토페이스트", "토마토퓨레", "파스닙", "파슬리", "팽이버섯", "포르타벨라버섯", "표고버섯", "표고버섯 말린것", "표고버섯가루", "풋고추", "풋마늘", "피클렐리쉬", "할라피뇨", "홍고추", "홍피망"],
#     ["과일류", "감귤쥬스", "감말랭이", "거봉포도", "건대추", "건포도", "골든키위", "곶감", "귤", "귤잼", "그린올리브", "그린키위", "냉동딸기", "냉동라즈베리", "냉동블루베리", "단감", "대추", "딸기", "딸기잼", "라임", "라임쥬스", "라임즙", "라즈베리", "라즈베리 통조림", "레몬", "레몬껍질", "레몬즙", "망고", "망고주스", "매실", "매실농축액", "메론", "무화과", "무화과 말린것", "바나나", "바질페스토", "배", "배간것", "배즙", "백도복숭아 통조림", "복분자", "복숭아잼", "블랙베리", "블랙올리브", "블루베리", "블루베리잼", "사과", "사과잼", "사과주스", "생강청", "석류", "수박", "아보카도", "오렌지", "오렌지주스", "올리브", "우메보시", "유자청", "자두", "자몽", "자몽주스", "참외", "천도복숭아", "청포도", "체리", "체리 통조림", "크랜베리", "크랜베리 말린것", "크랜베리주스", "파인애플", "파인애플 통조림", "파인애플주스", "포도", "포도잼", "포도주스", "홍시", "황도복숭아", "황도복숭아 통조림", "효소", "후르츠칵테일"] ,
#     ["고기류", "갈매기살", "곰탕", "다진고기", "닭가슴살", "닭고기", "닭날개", "닭넙적다리", "닭다리", "닭다리살", "닭모래집", "닭발", "닭봉", "닭살코기", "닭육수", "돼지갈비", "돼지고기간것", "돼지고기등심", "돼지뒷다리살", "돼지등뼈", "돼지목살", "돼지삼겹살", "돼지안심", "돼지앞다리", "돼지족발", "삼계탕", "소갈비", "소고기", "소등심", "소안심", "소양지", "소육수", "쇠고기간것", "쇠고기다진것", "양고기", "영계", "오리고기", "우둔살", "차돌박이", "채끝살", "치킨너겟", "치킨스톡", "칠면조고기", "하이스가루", "홍두깨살", "후라이드치킨"] ,
#     ["햄/소시지", "냉동돈가스", "동그랑땡", "둘리소시지", "미트소스", "베이컨", "불고기햄", "비엔나소시지", "살라미", "순대", "스팸", "스팸햄", "슬라이스햄", "옛날 소시지", "장조림", "초리조", "치킨까스", "핫도그", "햄버거패티", "후랑크햄"] ,
#     ["계란류", "계란", "계란노른자", "계란노른자 삶은것", "계란후라이", "계란흰자", "메추리알", "삶은계란"],
#     ["어패류", "가다랭이", "가다랭이포", "가리비", "간장게장", "갈치", "건멸치 작은것", "건멸치 중간크기", "건멸치 큰것", "건새우", "게맛살", "고등어", "고등어통조림", "고추참치통조림", "골뱅이통조림", "굴", "까나리액젓", "꼬막", "꼬치고기", "꽁치 말린것", "꽁치 통조림", "꽃게", "낙지", "날치알", "대구", "대구내장", "대하새우", "대합", "도다리", "동태", "멍게", "멸치다시육수", "멸치액젓", "멸치육수", "멸치통조림", "명란", "명란젓갈", "명태", "명태포", "모듬해물", "모시조개", "문어", "문어 삶은것", "미더덕", "바지락", "반건오징어", "밴댕이", "북어", "삼치", "새우젓갈", "새조개", "생골뱅이", "소라", "아귀", "어묵(오뎅)", "연어", "연어통조림", "오징어", "오징어젓갈", "우럭", "우렁", "잔새우", "장어", "전복", "전복내장", "전어젓갈", "조개관자", "조개관자", "조개살", "주꾸미", "중하새우", "쥐포", "진미오징어", "참치통조림", "코다리", "크래미", "피쉬소스", "피쉬스틱", "해파리", "홍합", "황태", "훈제연어"] ,
#     ["해조류", "건다시마", "건미역", "구운김", "김밥용김", "다시육수", "마른김", "매생이 말린것", "미역줄기", "생미역", "염장미역줄기", "톳나물", "파래", "한천"] ,
#     ["유제품/치즈류", "고다치즈", "그뤼에르치즈", "그릭요거트", "딸기우유", "리코타치즈", "모짜렐라치즈", "바나나우유", "바닐라아이스크림", "분유", "브리치즈", "블루치즈", "사워크림", "생크림", "스트링치즈", "앙팡치즈(서울우유)", "액상크림", "연유", "요거트", "요구르트", "체다치즈", "초코우유", "쵸콜렛아이스크림", "카망베르치즈", "커스터드크림", "커피우유", "크림치즈", "파마산치즈", "페타치즈", "폰티나치즈", "프로볼론치즈", "플레인요거트", "휘핑크림", "흰우유", "흰우유 무지방", "흰우유 저지방"] ,
#     ["양념류", "겨자분말", "겨자페이스트", "계피분말", "고추가루", "고추장", "고형 야채치킨스톡", "국간장", "굴소스", "굵은소금", "깨소금", "꿀", "낫또", "단풍잎", "데리야끼소스", "돈가스소스", "된장", "두반장", "라면스프", "마늘가루", "마요네즈", "맛소금", "머스터드소스", "메이플시럽", "멸치다시다", "미림", "미원", "바닐라 빈", "바닐라 에센스", "발사믹식초", "밥이랑", "배조청", "백설탕", "버터", "사과식초", "사우전아일랜드드레싱", "사탕수수시럽", "살사소스", "생강가루", "석류시럽", "소금", "쇠고기다시다", "슈가파우더", "식초", "실고추", "쌀식초", "쌈장", "아가베시럽", "애플민트", "애플민트", "양념간장", "양조간장", "올스파이스분말", "와사비페이스트", "우스터소스", "우스터소스", "일본된장", "자일로스설탕", "진간장", "짜장분말", "쯔유", "참치액", "찹쌀고추장", "청국장", "초고추장", "초피가루", "쵸코시럽", "춘장", "칠리소스", "칠리파우더", "카레가루", "커민가루", "코셔소금", "콘시럽", "타르타르소스", "타바스코소스", "토마토소스", "토마토케찹", "파슬리가루", "파프리카분말", "한식된장", "핫소스", "해선장소스", "허니머스타드", "허브솔트", "현미식초", "황설탕", "후추", "흑설탕", "흑후추", "흰후추"] ,
#     ["초콜렛/사탕", "가나초콜릿(롯데)", "구미젤리", "누텔라", "다크초콜릿", "마쉬맬로우", "물엿", "밀크초콜릿", "사탕", "올리고당", "젤라틴", "젤라틴 물혼합", "젤리", "초콜릿", "쵸코볼", "팥양갱", "화이트초콜릿"],
#     ["음료/주류", "계피차 분말", "녹차가루", "녹차잎", "두유", "럼", "레드와인", "막걸리", "맥주", "물", "보드카", "보리차", "사이다", "사케", "샴페인", "소다수", "소주", "쌍화차 분말", "얼음", "에스프레소", "위스키", "청주", "치커리차 말린것", "커피", "커피가루", "커피믹스", "커피원두", "코코아가루", "콜라", "화이트와인", "흑맥주"]
# ].each do |item|
#   item_ingre = item.delete(item[0])
#   Item_f.create(ssf_category: item[0], ss_ingred: item_ingre)
# end






